tutorials/lagrangian/reactingParcelFoam/hotBoxes/0/wallFilmRegion/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/wallFilmRegion";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform  300;

boundaryField
{
    // top film surface
    "(.*top)"
    {
        type            zeroGradient;
    }

    // mapped boundaries
    "(region0_to.*)"
    {
//        type            zeroGradient;
        type            fixedValue;
        value           uniform 350.0;
    }

    // floor sides
    walls
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
